-- day05 
-- (6) ¿¬»êÀÚ 7.¿¬»êÀÚ ¿ì¼±¼øÀ§ 
-- 1.°ýÈ£ 2.ºñ±³¿¬»êÀÚ 3.NOT 4.AND 5.OR 

/*
ÁÖ¾îÁø Á¶°Ç 3°³ 
1.mgr = 7698 
2.job = 'CLERK' 
3.sal > 1300

ÀÌÁ¶°ÇÀÇ Á¶ÇÕ ¼ø¼­¿¡ µû¶ó °á°ú°¡ ¾î¶»°Ô ´Þ¶óÁö´ÂÁö È®ÀÎÇØº¸ÀÚ 
*/ 
 
--1) ¸Å´ÏÀúÀÇ »ç¹øÀÌ 7698ÀÌ¸ç , Á÷¹«´Â 'CLERAK'ÀÌ°Å³ª   
--   ±Þ¿©°¡ 1300ÀÌ ³Ñ´Â Á¶°ÇÀ» ¸¸Á·ÇÏ´Â Á÷¿øÀÇ Á¤º¸¸¦ Á¶È¸ 
--   »ç¹ø, ÀÌ¸§, Á÷¹«,±Þ¿© ¸Å´ÏÀú »ç¹ø 

SELECT e.empno 
     , e.ename
     , e.job 
     , e.sal 
     , e.mgr
  FROM emp e
 WHERE e.mgr =7698 
   AND e.job ='CLERK' 
    OR e.sal > 1300 
;
/*
EMPNO, ENAME,       JOB,     SAL,    MGR 
-----------------------------------------
7499	ALLEN	SALESMAN	1600	7698
7566	JONES	MANAGER	    2975	7839
7698	BLAKE	MANAGER	    2850	7839
7782	CLARK	MANAGER	    2450	7839
7839	KING	PRESIDENT	5000	
7844	TURNER	SALESMAN	1500	7698
7900	JAMES	CLERK	    950 	7698
7902	FORD	ANALYST	    3000	7566
*/
--  ¡Ú=> CLEARK + 7698 °á°ú 1°³ 
-- 1300 > sal  °á°ú 7°³ 

---------------------------------------------------------------------------------

--2) ¸Å´ÏÀú°¡ 7698ÀÎ Á÷¿øÁß¿¡¼­  
--  Á÷¹«°¡ 'CLEARK' ÀÌ°Å³ª ±Þ¿©°¡ 1300ÀÌ ³Ñ´Â Á÷¿ø Á¤º¸ Á¶È¸

SELECT e.empno 
     , e.ename
     , e.job 
     , e.sal 
     , e.mgr
  FROM emp e
 WHERE e.mgr =7698 
   AND (e.job ='CLERK' OR e.sal >1300)
;
/*
EMPNO, ENAME,    JOB,       SAL,    MGR 
----------------------------------------
7499	ALLEN	SALESMAN	1600	7698
7844	TURNER	SALESMAN	1500	7698
7900	JAMES	CLERK	    950 	7698
*/

---------------------------------------------------------------------------------



--3) Á÷¹«°¡ CLERK ÀÌ°Å³ª ±Þ¿©°¡ 1300 ³ÑÀ¸¸é¼­ 
--    ¸Å´ÏÀú°¡ 7698ÀÎ Á÷¿ø Á¤º¸ Á¶È¸ 

SELECT e.empno 
     , e.ename 
     , e.job 
     , e.sal 
     , e.mgr 
  FROM emp e 
 WHERE e.job ='CLERK' 
    OR e.sal> 1300
   AND e.mgr = 7698 
;

/*
EMPNO, ENAME,   JOB,        SAL,    MGR 
----------------------------------------
9999	J_JAMES	CLERK		
8888	J%JAMES	CLERK		
7369	SMITH	CLERK	    800	    7902
7499	ALLEN	SALESMAN	1600	7698
7844	TURNER	SALESMAN	1500	7698
7900	JAMES	CLERK	    950	    7698
7934	MILLER	CLERK	    1300	7782
*/

-- ¡Ú=> AND ¿¬»êÀÚ´Â OR¿¬»êÀÚº¸´Ù ¿ì¼±¼øÀ§°¡ ³ô±â ¶§¹®¿¡  
--    µÎ¹øÂ° Äõ¸®Ã³·³ °ýÈ£¸¦ »ç¿ëÇÏÁö ¾Ê¾Æ°í ¼öÇà°á°ú°¡ µ¿ÀÏÇÏ°Ô ³ª¿Â´Ù.

---------------------------------------------------------------------------------
---------------------------------6. ÇÔ¼ö-----------------------------------------
---------------------------------------------------------------------------------

--(3) ´ÜÀÏÇà ÇÔ¼ö  
------1) ¼ýÀÚÇÔ¼ö: 
----------1.MOD(m,n) : mÀ»nÀ¸·Î ³ª´« ³ª¸ÓÁö °è»ê ÇÔ¼ö  
SELECT mod(10,3) 
  FROM emp 
; 

-- °á°ú 1ÀÌ empÅ×ÀÌºíÀÇ Çà ¼ö ¸¸Å­ ¹Ýº¹ Ãâ·Â 

SELECT mod(10,3) 
  FROM dept 
;
-- ¿¤¸®¾î½º¸¦ ÁÖÁö ¾Ê¾Æ¼­ mod°¡ ´ë¹®ÀÚ·Î ­x·Â

--¹®Á¦ :°¢ »ç¿øÀÇ ±Þ¿©¸¦ 3À¸·Î ³ª´« ³ª¸ÓÁö¸¦ Á¶È¸ 
SELECT mod(e.sal,3)
  FROM emp e 
; 

/*
MOD(E.SAL,3)
-------------
2
1
2
2
2
0
2
2
0
2
0
1
*/ 

--¹®Á¦ emp Å×ÀÌºí¿¡¼­ °¢ »ç¿øÀÇ ±Þ¿©¸¦ 4À¸·Î ³ª´« ³ª¸ÓÁö¸¦ »ç¹ø°ú ÇÔ²² Á¶È¸ÇÏ½Ã¿À 
SELECT  e.empno 
     , mod(e.sal,3)
  FROM emp e 
; 
--=> ´ÜÀÏÇà ÇÔ¼ö´Â Å×ÀÌºíÀÇ 1Çà´ç 1¹ø¾¿ Àû¿ë 

--------2.ROUND(m,n) : ½Ç¼ö mÀ» ¼Ò¼öÁ¡ n + 1 ÀÚ¸®¿¡¼­ ¹Ý¿Ã¸² ÇÑ °á°ú °è»ê 
SELECT ROUND(1234.56,1) 
  FROM dual
;
--=>¸Ç µÞÀÚ¸® ¿Ã¸²
--1-1
SELECT ROUND(1234.56,0) 
  FROM dual
;
--1-2
SELECT ROUND(1234.56,0) 
  FROM dual
;
/*1235*/

--2-1
SELECT ROUND(1234.46,0) 
  FROM dual
;
/*1234*/
--ROUND(m) : n°ªÀ» »ý·«ÇÏ¸é n=0ÀÎ°ÍÀ¸·Î ¿¬»êÇÑ °á°ú¸¦ µ¹·ÁÁÜ




--------3.TRUNC(m,n) : ½Ç¼ö mÀ» n¿¡¼­ ÁöÁ¤ÇÑ ÀÚ¸® ÀÌÇÏ ¼Ò¼öÁ¡À» ¹ö¸² 
SELECT TRUNC(1234.46,1) 
  FROM dual
;
/*1234.5*/
SELECT TRUNC(1234.46,0) 
  FROM dual
;
/*1234*/
--TRUNC(m): nÀÌ »ý·«µÈ °æ¿ì¿¡´Â n=0À¸·Î ¼öÇàÇÑ´Ù. Áï ¼Ò¼öÁ¡ ÀÌÇÏ ¸ðµÎ ¹ö¸² ¿¬»ê  
SELECT TRUNC(1234.46) 
  FROM dual
;

--------4.CEIL(n):ÀÔ·ÂµÈ ½Ç¼ö n¿¡¼­ °°°Å³ª °¡Àå Å« Á¤¼ö 
SELECT CEIL(1234.56) --1234 or 1235
FROM dual 
; 
/*1235*/
SELECT CEIL(1234.001) 
FROM dual 
; 
/*1235*/

-------5.FLOOR(n) :ÀÔ·ÂµÈ ½Ç¼ön¿¡¼­ °°°Å³ª °¡Àå °¡±î¿î ÀÛÀº Á¤¼ö 

SELECT FLOOR(1234.56) 
FROM dual 
; 
--1234
SELECT FLOOR(1234.001) 
FROM dual 
; 
--1234
SELECT FLOOR(1234.001) 
FROM dual 
; 
/*1235*/

------6.WIDTH_BYCKET(expr.min,nax,byckets) 
-- min ~ max °ª »çÀÌ¸¦ buckets°³¼ö¸¸Å­ À¸·Î ³ª´©°í 
-- exprÀÌ Ãâ·ÂÇÏ´Â °ªÀÌ ¾î´À buckets¿¡ À§Ä¡ÇÏ´ÂÁö ¼ýÀÚ·Î ¾Ë·ÁÁÜ 

--±Þ¿©¸¦ ¹üÀ§¸¦ 0~5000À¸·Î Àâ°í , ÇÑbucketÀ» 1000´ÜÀ§·Î ³ª´©¸é 
--ÃÑ 5°³ÀÇ buketÀÌ ÀÖÀ½À» ¾Ë¼ö ÀÖÀ¸¹Ç·Î 
--°¢ Á÷¿øÀÇ ±Þ¿©°¡ ¾î´À bucket¿¡ À§Ä¡ÇÏ´ÂÁö ±¸ÇØº¸ÀÚ

SELECT e.empno 
     , e.ename 
     , e.sal 
     , WIDTH_BUCKET(e.sal, 0, 5000, 5) as "±Þ¿©±¸°£" 
  FROM emp e 
 ORDER BY "±Þ¿©±¸°£"
;
---------------------------------------------------------------------------------
---------------------------------------------------------------------------------
---------------------------------------------------------------------------------
---------------------------------------------------------------------------------
---------------------------------------------------------------------------------
---------------------------------------------------------------------------------
 